/*******************************************************************************
* Copyright 2016 HangZhou 杭州久天科技有限公司
* All right reserved
*
* 文件名称：led.c
*
* 文件标识：
* 摘    要：
*
*
* 当前版本：v1.0
* 作    者：lhb Steven
* 完成日期：2016/3/14
* 编译环境：C:\Program Files (x86)\IAR Systems\Embedded Workbench 6.5\stm8        
*
* 历史信息：
*******************************************************************************/
#include "Led.h"

#define LED_R   PC_ODR_ODR2
#define LED_G   PC_ODR_ODR4
#define LED_B   PC_ODR_ODR3 

/**********************************************函数定义***************************************************** 
* 函数名称: void LedInit(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能: led初始化  
* 作    者: by lhb_steven
* 日    期: 2016/3/14
************************************************************************************************************/ 
void LedInit(void) { 
    PB_DDR_DDR1 = 1;//状态指示灯
    PB_CR1_C11 = 1;
    PB_CR2_C21 = 1;
    
    PC_DDR_DDR2 = 1;//电量 RGB
    PC_CR1_C12 = 1;
    PC_CR2_C22 = 1;
    
    PC_DDR_DDR3 = 1;
    PC_CR1_C13 = 1;
    PC_CR2_C23 = 1;
    
    PC_DDR_DDR4 = 1;
    PC_CR1_C14 = 1;
    PC_CR2_C22 = 1;
    LedSetPower(2);
}
/**********************************************函数定义***************************************************** 
* 函数名称: void LedSetMode(u8 data) 
* 输入参数: u8 data 
* 返回参数: void  
* 功    能: 设置当前Led模式  
* 作    者: by lhb_steven
* 日    期: 2016/3/14
************************************************************************************************************/ 
void LedSetMode(u8 data) { 
 
}
/**********************************************函数定义***************************************************** 
* 函数名称: void LedSetPower(u8 cmd) 
* 输入参数: u8 cmd 
* 返回参数: void  
* 功    能: 设置电量状态  
* 作    者: by lhb_steven
* 日    期: 2016/3/14
************************************************************************************************************/ 
void LedSetPower(u8 cmd) { 
    switch( cmd ) {
        case 0:
        LED_R = 0;
        LED_G = 1;
        LED_B = 1;
        break;
        case 1:
        LED_R = 1;
        LED_G = 0;
        LED_B = 1;
        break;
        case 2:
        LED_R = 1;
        LED_G = 1;
        LED_B = 0;
        break;
        default:
        break;
    }
}








